---
kind: type
id: T:Autodesk.Revit.DB.ColumnAttachmentJustification
source: html/39a5a31b-dc66-8db0-1f12-07c22e3bac09.htm
---
# Autodesk.Revit.DB.ColumnAttachmentJustification

Control the column extent in cases where the target is not a uniform height.

## Syntax (C#)
```csharp
public enum ColumnAttachmentJustification
```